In [1]:
## importing libraries
import pandas as pd
import seaborn as sns

In [2]:
## Load Dataset
data = sns.load_dataset('tips')

In [3]:
data.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.4 KB

In [5]:
data['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [6]:
data['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [24]:
X = data.drop('total_bill',axis=1)
y = data['total_bill']

In [25]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.25)

In [26]:
X_train

      tip     sex smoker  day    time  size
220  2.20    Male    Yes  Fri   Lunch     2
206  3.41    Male    Yes  Sat  Dinner     3
98   3.00    Male    Yes  Fri  Dinner     2
188  3.50  Female    Yes  Sun  Dinner     3
40   2.24    Male     No  Sat  Dinner     3
..    ...     ...    ...  ...     ...   ...
43   1.32    Male     No  Sun  Dinner     2
3    3.31    Male     No  Sun  Dinner     2
67   1.00  Female    Yes  Sat  Dinner     1
160  3.50    Male     No  Sun  Dinner     4
31   2.50    Male     No  Sat  Dinner     4

[183 rows x 6 columns]

In [27]:
day = pd.get_dummies(X_train['day'])
X_train.drop('day', axis=1, inplace=True)
X_train = pd.concat([X_train,day], axis=1)

In [28]:
X_train

      tip     sex smoker    time  size   Thur    Fri    Sat    Sun
220  2.20    Male    Yes   Lunch     2  False   True  False  False
206  3.41    Male    Yes  Dinner     3  False  False   True  False
98   3.00    Male    Yes  Dinner     2  False   True  False  False
188  3.50  Female    Yes  Dinner     3  False  False  False   True
40   2.24    Male     No  Dinner     3  False  False   True  False
..    ...     ...    ...     ...   ...    ...    ...    ...    ...
43   1.32    Male     No  Dinner     2  False  False  False   True
3    3.31    Male     No  Dinner     2  False  False  False   True
67   1.00  Female    Yes  Dinner     1  False  False   True  False
160  3.50    Male     No  Dinner     4  False  False  False   True
31   2.50    Male     No  Dinner     4  False  False   True  False

[183 rows x 9 columns]